BE/app/controllers/v1/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save